package myFile.IO;

/*      IO流概述：
*               IO：输入/输出(Input/output)
*               流：是一种抽象概念，是数据传输的总称
*               IO流就是用来处理设备间数据创数问题的
*                   常见引用：文件复制、文件上传、文件下载
*       IO流分类：
*               按照数据的流向分类：
*                   输入流：读数据
*                   输出流：写数据
*               按照数据类型来分：
*                   字节流：
*                           字节输入流，字节输出流
*                   字符流：
*                           字符输入流，字符输出流
*           一般的分类都是按照数据类型分类的
*           两种流的使用场景：
*               如果数据通过Windows自带的记事本可以打开，我们还可以读懂里面的内容的，用字符流
*               否则使用字节流
*               如果不清楚该用那种流，就用字节流*/
public class myIO_fenlei {
}
